WSDL/OpenShipService/OpenShip_v15/RetrieveOpenShipment.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v15="http://fedex.com/ws/openship/v15">
   <soapenv:Header/>
   <soapenv:Body>
      <v15:RetrieveOpenShipmentRequest>
         <v15:WebAuthenticationDetail>
            <v15:ParentCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:ParentCredential>
            <v15:UserCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:UserCredential>
         </v15:WebAuthenticationDetail>
         <v15:ClientDetail>
            <v15:AccountNumber>INPUT YOUR INFORMATION</v15:AccountNumber>
            <v15:MeterNumber>INPUT YOUR INFORMATION</v15:MeterNumber>
            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:ClientDetail>
         <v15:TransactionDetail>
            <v15:CustomerTransactionId>RetrieveOpenShipmentRequest_v6</v15:CustomerTransactionId>
            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:TransactionDetail>
         <v15:Version>
            <v15:ServiceId>ship</v15:ServiceId>
            <v15:Major>15</v15:Major>
            <v15:Intermediate>0</v15:Intermediate>
            <v15:Minor>0</v15:Minor>
         </v15:Version>
         <v15:Index>Key769</v15:Index>
      </v15:RetrieveOpenShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>


Response:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <RetrieveOpenShipmentReply xmlns="http://fedex.com/ws/openship/v15">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>ship</Source>
            <Code>0000</Code>
            <Message>Success</Message>
            <LocalizedMessage>Success</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>RetrieveOpenShipmentRequest_v6</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>14</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2017-07-10T11:08:04-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>PRIORITY_OVERNIGHT</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <PreferredCurrency>USD</PreferredCurrency>
            <Shipper>
               <AccountNumber>150067600</AccountNumber>
               <Contact>
                  <PersonName>SWAPNIL GHADAGE</PersonName>
                  <CompanyName>SYNTEL</CompanyName>
                  <PhoneNumber>9764859161</PhoneNumber>
                  <EMailAddress>SWAPNILSGHADAGE@SYNTEL.COM</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>BARAMATI 1</StreetLines>
                  <City>Memphis</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38118</PostalCode>
                  <CountryCode>US</CountryCode>
                  <Residential>false</Residential>
               </Address>
            </Shipper>
            <Recipient>
               <AccountNumber>150067600</AccountNumber>
               <Contact>
                  <PersonName>NILESH JARAD</PersonName>
                  <CompanyName>bYNTEL</CompanyName>
                  <PhoneNumber>9764859156</PhoneNumber>
                  <EMailAddress>NILESHJARAD@BYNTEL.COM</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>BARAMATI 1</StreetLines>
                  <City>Memphis</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38118</PostalCode>
                  <CountryCode>US</CountryCode>
                  <Residential>false</Residential>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>150067600</AccountNumber>
                     <Contact>
                        <PersonName>SWAPNIL GHADAGE</PersonName>
                        <CompanyName>SYNTEL</CompanyName>
                        <PhoneNumber>9764859161</PhoneNumber>
                        <EMailAddress>SWAPNILSGHADAGE@SYNTEL.COM</EMailAddress>
                     </Contact>
                     <Address>
                        <StreetLines>BARAMATI 1</StreetLines>
                        <City>Memphis</City>
                        <StateOrProvinceCode>TN</StateOrProvinceCode>
                        <PostalCode>38118</PostalCode>
                        <CountryCode>US</CountryCode>
                        <Residential>false</Residential>
                     </Address>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <CustomsClearanceDetail>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>150067600</AccountNumber>
                        <Contact>
                           <PersonName>SWAPNIL GHADAGE</PersonName>
                           <CompanyName>SYNTEL</CompanyName>
                           <PhoneNumber>9764859161</PhoneNumber>
                           <EMailAddress>SWAPNIL_GHADAGE@GMAIL.COM</EMailAddress>
                        </Contact>
                        <Address>
                           <StreetLines>BARAMATI</StreetLines>
                           <City>Memphis</City>
                           <StateOrProvinceCode>TN</StateOrProvinceCode>
                           <PostalCode>38118</PostalCode>
                           <CountryCode>US</CountryCode>
                           <Residential>false</Residential>
                        </Address>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <DocumentContent>DOCUMENTS_ONLY</DocumentContent>
               <CustomsValue>
                  <Currency>USD</Currency>
                  <Amount>2500.0</Amount>
               </CustomsValue>
               <PartiesToTransactionAreRelated>false</PartiesToTransactionAreRelated>
               <CommercialInvoice>
                  <TermsOfSale>DAP</TermsOfSale>
               </CommercialInvoice>
               <Commodities>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>sdf</Description>
                  <Purpose>CONSUMER</Purpose>
                  <CountryOfManufacture>US</CountryOfManufacture>
                  <Weight>
                     <Units>LB</Units>
                     <Value>20.22</Value>
                  </Weight>
                  <Quantity>1.0</Quantity>
                  <QuantityUnits>cm</QuantityUnits>
                  <UnitPrice>
                     <Currency>USD</Currency>
                     <Amount>45.0</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>USD</Currency>
                     <Amount>2500.0</Amount>
                  </CustomsValue>
               </Commodities>
            </CustomsClearanceDetail>
            <BlockInsightVisibility>false</BlockInsightVisibility>
            <LabelSpecification>
               <Dispositions>
                  <DispositionType>STORED</DispositionType>
               </Dispositions>
               <LabelFormatType>COMMON2D</LabelFormatType>
               <ImageType>PNG</ImageType>
               <LabelStockType>PAPER_4X6</LabelStockType>
               <LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</LabelPrintingOrientation>
            </LabelSpecification>
            <RateRequestTypes>LIST</RateRequestTypes>
            <PackageCount>5</PackageCount>
         </RequestedShipment>
      </RetrieveOpenShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


Additional Info:
URL:https://wsbeta.fedex.com:443/web-services/openship
Date:Mon Jul 10 13:26:32 IST 2017
TimeTaken:720ms
